driver-tests/bpelse/assign/AssignLiteralJbi/test/LiteralXmlWithNoWhiteSpace/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:WorkflowInformation xmlns:msgns="http://www.truebaseline.com/MEF" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wor="http://www.truebaseline.com/TrueOMF/WorkflowInformation.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns1="http://www.truebaseline.com/TrueOMF/WorkflowInformation.xsd">
      <wor:EventMessage>
        <wor:Id>f5984046-1260-4359-bfaa-2da952a976ba</wor:Id>
        <wor:EventName>GetServiceOrderPoliciesXmlListRequest</wor:EventName>
        <wor:EventType>EventMessage</wor:EventType>
        <wor:SourceUri>mef://Security</wor:SourceUri>
        <wor:TargetUri>mef://LocalStore</wor:TargetUri>
        <wor:IsSynchronous>false</wor:IsSynchronous>
        <wor:CorrelationId>00d053ed-0323-4cbd-aaef-1a9748142f20</wor:CorrelationId>
        <wor:Created>2007-06-27T18:13:21.6115985-04:00</wor:Created>
        <wor:Body>
          <wor:Request>
            <wor:Parameters xmlns="http://www.truebaseline.com/TrueOMF/WorkflowInformation.xsd" xmlns:bpws="http://docs.oasis-open.org/wsbpel/2.0/process/executable" xmlns:ns0="http://www.truebaseline.com/TrueOMF/WorkflowInformation.xsd" xmlns:ns1="http://www.truebaseline.com/CallSD.wsdl" xmlns:ns2="http://www.truebaseline.com/AlertMefBpel" xmlns:ns4="http://www.truebaseline.com/UtilityService" xmlns:ns5="http://www.truebaseline.com/TrueOMF/WorkflowInformation.xsd" xmlns:ns6="http://www.truebaseline.com/CallMef.wsdl" xmlns:ns7="http://www.truebaseline.com/LogCurrentState.wsdl" xmlns:ns8="http://www.truebaseline.com/MEF" xmlns:tns="http://www.truebaseline.com/bpel/MefWorkflow/AlertMef">
              <Parameter isIn="false" isOut="true" name="serviceInstanceGuid">
                <Value>dddddddd-0323-4cbd-aaef-1a9748142f20</Value>
              </Parameter>
              <Parameter isIn="false" isOut="true" name="policyType">
                <Value/>
              </Parameter>
            </wor:Parameters>
          </wor:Request>
          <wor:Response>
            <wor:Parameters>
            </wor:Parameters>
          </wor:Response>
        </wor:Body>
        <wor:Credentials>
          <wor:Base64>kew98</wor:Base64>
        </wor:Credentials>
      </wor:EventMessage>
      <wor:Configuration>
        <wor:IsProcessInterceptEnabled>false</wor:IsProcessInterceptEnabled>
        <wor:IsCustomLoggingEnabled>false</wor:IsCustomLoggingEnabled>
        <wor:IsWaitAtBreakpointsEnabled>true</wor:IsWaitAtBreakpointsEnabled>
      </wor:Configuration>
    </ns1:WorkflowInformation>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
