driver-tests/bpelse/assign/AssignLiteralJbi/test/LiteralXmlWithNoWhiteSpace/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wor="http://www.truebaseline.com/TrueOMF/WorkflowInformation.xsd">
  <soapenv:Body>
    <wor:WorkflowInformation>
      <wor:EventMessage>
        <wor:Id>f5984046-1260-4359-bfaa-2da952a976ba</wor:Id>
        <wor:EventName>ActivateAlertRequest</wor:EventName>
        <wor:EventType>EventMessage</wor:EventType>
        <wor:SourceUri>mef://OperatorInput</wor:SourceUri>
        <wor:TargetUri>mef://Security</wor:TargetUri>
        <wor:IsSynchronous>false</wor:IsSynchronous>
        <!--Optional:-->
        <wor:CorrelationId>00d053ed-0323-4cbd-aaef-1a9748142f20</wor:CorrelationId>
        <wor:Created>2007-06-27T18:13:21.6115985-04:00</wor:Created>
        <wor:Body>
          <!--Optional:-->
          <wor:Request>
            <!--Optional:-->
               <wor:Parameters>
                  <wor:Parameter isIn="true" isOut="false" name="serviceOrderGuid">
                     <wor:Value>d5984046-1260-4359-bfaa-2da952a976be</wor:Value>
                  </wor:Parameter>
                  <wor:Parameter isIn="true" isOut="false" name="elementOfferGuid">
                     <wor:Value>85984046-1260-4359-bfaa-2da952a976ba</wor:Value>
                  </wor:Parameter>
               </wor:Parameters>
          </wor:Request>
          <!--Optional:-->
          <wor:Response>
            <!--Optional:-->
            <wor:Parameters>
              <!--Optional:-->
            </wor:Parameters>
          </wor:Response>
        </wor:Body>
        <!--Optional:-->
        <wor:Credentials>
          <wor:Base64>kew98</wor:Base64>
        </wor:Credentials>
      </wor:EventMessage>
      <!--Optional:-->
      <wor:Configuration>
        <wor:IsProcessInterceptEnabled>false</wor:IsProcessInterceptEnabled>
        <wor:IsCustomLoggingEnabled>false</wor:IsCustomLoggingEnabled>
        <wor:IsWaitAtBreakpointsEnabled>true</wor:IsWaitAtBreakpointsEnabled>
      </wor:Configuration>
    </wor:WorkflowInformation>
  </soapenv:Body>
</soapenv:Envelope>